## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                |
|--------|------------------------------------|
| add    | `aws_ssm_parameter.docdb_password` |
|        | `aws_ssm_parameter.docdb_username` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m13:33:02.906[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m13:33:02.906[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_ssm_parameter.docdb_password will be created
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ssm_parameter" "docdb_password" {
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn            = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + data_type      = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + insecure_value = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key_id         = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name           = "docdb_password"
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags           = {
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all       = {
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tier           = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type           = "SecureString"
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + value          = (sensitive value)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version        = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_ssm_parameter.docdb_username will be created
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ssm_parameter" "docdb_username" {
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn            = (known after apply)
[0;90m13:33:02.907[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + data_type      = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + insecure_value = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key_id         = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name           = "docdb_username"
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags           = {
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all       = {
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tier           = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type           = "SecureString"
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + value          = (sensitive value)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version        = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 2 to add, 0 to change, 0 to destroy.
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + docdb_password_arn = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + docdb_username_arn = (known after apply)
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m13:33:02.908[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
